name: "rtmdet_ins_tiny_preprocess"
backend: "python"
input [
    {
        name: "preprocess_input"
        data_type: TYPE_STRING
        dims: [1]
    }
]
output [
    {
        name: "preprocess_output"
        data_type: TYPE_FP16
        dims: [1, 3, 640, 640]
        reshape: { shape: [3, 640, 640] }
    }
]

parameters: [
    {
        key: "model_input_size",
        value: {string_value: "640,640"}
    }
]