name: "ensemble_yolox_tiny_coco80"
platform: "ensemble"
input [
    {
        name: "input_images"
        data_type: TYPE_STRING
        dims: [1]
    }
]
output [
    {
        name: "output_boxes"
        data_type: TYPE_FP32
        dims: [-1, 4]
    },
    {
        name: "output_scores"
        data_type: TYPE_FP32
        dims: [-1, 1]
    },
    {
        name: "output_classes"
        data_type: TYPE_FP32
        dims: [-1, 1]
    }
]

ensemble_scheduling {
    step [
        {
            model_name: "yolox_tiny_preprocess"
            model_version: -1
            input_map {
                key: "preprocess_input"
                value: "input_images"
            }
            output_map {
                key: "preprocess_output"
                value: "preprocess_result"
            }
        },
        {
            model_name: "yolox_tiny_coco80_trt_fp16"
            model_version: -1
            input_map {
                key: "images"
                value: "preprocess_result"
            }
            output_map {
                key: "output"
                value: "yolox_result"
            }
        },
        {
            model_name: "yolox_tiny_postprocess"
            model_version: -1
            input_map {
                key: "postprocess_input"
                value: "yolox_result"
            }
            output_map {
                key: "postprocess_output_boxes"
                value: "output_boxes"
            }
            output_map {
                key: "postprocess_output_scores"
                value: "output_scores"
            }
            output_map {
                key: "postprocess_output_classes"
                value: "output_classes"
            }
        }
    ]
}